Revit 2026 API

# UVSubtraction Operator

---

Subtracts the two specified 2-D vectors and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static UV operator -(
	UV left,
	UV right
)
```
```vb
Public Shared Operator - (
	left As UV,
	right As UV
) As UV
```
```cpp
public:
static UV^ operator -(
	UV^ left,
	UV^ right
)
```
```fsharp
static let inline (-)
        left : UV *
        right : UV  : UV
```

#### Parameters

left UV
    The first vector.
right UV
    The second vector.

#### Return Value

UVThe 2-D vector equal to the difference between the two source vectors.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when left or right is . |

The subtracted vector is obtained by subtracting each coordinate of the right vector from the corresponding coordinate of the left vector.

#### Reference

UV Class

Autodesk.Revit.DB Namespace